Revit 2022 API
IFCFileWriteOptions Members
The IFCFileWriteOptions type exposes the following members.
Constructors
Name | Description
IFCFileWriteOptions
 Creates a default IFCFileWriteOptions. The default file format is ifc.
Methods
Name | Description
Dispose
Releases all resources used by the IFCFileWriteOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FileFormat
 The file format of the IFC file.
FileName
 The full file name of the IFC file to be written.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
XMLConfigFileName
 The XML configuration file name. It is used only for writing IFC-XML format file.
See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace